tap "derailed/k9s"
tap "homebrew/bundle"
tap "skatkov/tap"
tap "warrensbox/tap"
brew "arp-scan"
brew "awscli"
brew "bat"
brew "btop"
brew "glib"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "curl"
brew "dateutils"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "helm"
brew "htop"
brew "python@3.12"
brew "imagemagick"
brew "jless"
brew "jq"
brew "k6"
brew "kubernetes-cli", link: false
brew "lazydocker"
brew "llvm"
brew "make"
brew "mise"
brew "moreutils"
brew "neovim"
brew "nmap"
brew "openvpn"
brew "perl"
brew "pipx"
brew "qemu"
brew "rclone"
brew "ripgrep"
brew "stow"
brew "tailscale"
brew "terraform-docs"
brew "tflint"
brew "tlrc"
brew "tmux"
brew "tree"
brew "unzip"
brew "vault"
brew "wget"
brew "xclip"
brew "youtube-dl"
brew "yq"
brew "zizmor"
brew "zplug"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"
brew "skatkov/tap/devtui"
cask "balenaetcher"
cask "dbeaver-community"
cask "docker-desktop"
cask "firefox"
cask "iterm2"
cask "mitmproxy"
cask "ngrok"
cask "signal"
cask "spotify"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
