cask 'balenaetcher'
cask 'dbeaver-community'
cask 'docker'
cask 'firefox'
cask 'iterm2'
cask 'ngrok'
cask 'signal'
cask 'spotify'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'  
cask 'whatsapp'
cask 'zoom'

brew 'awscli'
brew 'bat'
brew 'bitwarden-cli'
brew 'cdktf'
brew 'cmake'
brew 'coreutils'
brew 'fzf'
brew 'git-delta'
brew 'gnutls'
brew 'goenv'
brew 'htop'
brew 'jless'
brew 'jq'
brew 'lazydocker'
brew 'make'
brew 'moreutils'
brew 'n'
brew 'neovim'
brew 'openjdk'
brew 'openvpn'
brew 'perl'
brew 'postgresql@14'
brew 'pyenv'
brew 'rust'
brew 'stow'
brew 'tfenv'
brew 'tflint'
brew 'tlrc'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'warrensbox/tap/tfswitch'
brew 'wget'
brew 'xclip'
brew 'zig'
brew 'zplug'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'